# EditScope Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EditScope Members
EditScope Class Methods Properties See Also
---
The EditScope type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Cancels the edit scope. |
| Commit | Finishes the edit scope. |
| Dispose | Releases all resources used by the EditScope |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
| IsPermitted | Tells if the edit scope is permitted to start. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
EditScope Class
Autodesk.Revit.DB Namespace